Revit 2024 API
IPipeFittingAndAccessoryPressureDropServer.Calculate Method
 Calculate the pipe fitting and pipe accessory coefficient.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
bool Calculate(
	PipeFittingAndAccessoryPressureDropData data
)
Visual Basic
Function Calculate ( _
	data As PipeFittingAndAccessoryPressureDropData _
) As Boolean
Visual C++
bool Calculate(
	PipeFittingAndAccessoryPressureDropData^ data
)
Parameters
data
Type: Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData
 The input and output data of the calculation.
Return Value
 True if calculation succeeds. False if calculation fails.
See Also
IPipeFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace